'''
#>1空元祖t=()
#>2元组里面只有一个数据，要加一个逗号，才会是元组类型
#>3元组里面的元素类型可以是任意类型，不同的数据类型之间用逗号隔开
#>4元组是有下标的，正序/反序编号都支持，取值方式同字符串
#>4.1单个取值  元组名[索引号]  索引从0开始
#>4.2切片  元组名[m:n:k]  [索引头:索引尾：步长]
#>5嵌套取值，元组里面还有元组:::层级定位
#>6元组是不可变类型,是有序的
'''


####1元组 tuple()
#>1空元祖t=()
a=()
print(type(a))
print('1***************************')
#>2元组里面只有一个数据，要加一个逗号，才会是元组类型
t1=(1)
print(type(t1))##int
t2=(1,)
print(type(t2))##tuple
t3=((1))
print(type(t3))###int
print('2***************************')
#>3元组里面的元素类型可以是任意类型，不同的数据类型之间用逗号隔开
t=(1,0.01,True,'Hello',(1,2,3))
print(len(t))
t=(1,0.01,True,'Hello',(1,2,3),[1,2,3])###列表，字典也可以的
print(len(t))
print('3***************************')
#>4元组是有下标的，正序/反序编号都支持，取值方式同字符串
t=(1,0.01,True,'Hello',(1,2,3))#0,1,2,3,4
#>4.1单个取值  元组名[索引号]  索引从0开始
print(t[0])#1
print(t[-5])#1
print('4.1***************************')
#>4.2切片  元组名[m:n:k]  [索引头:索引尾：步长]
print(t[::-1])##((1, 2, 3), 'Hello', True, 0.01, 1)倒叙输出
print('4.2***************************')
#>5嵌套取值，元组里面还有元组:::层级定位
t=(1,0.01,True,'Hello',(1,2,3,666))#0
print(t[-1][-1])####666
print(t[-1][3])####666
t=(1,0.01,True,'Hello',(1,2,3,666,'Python'),)#0
print(t[-1][-1][1])####y
print('5***************************')
#>6元组是不可变类型,是有序的
t=(1,0.01,True,'Hello',(1,2,3,666,'Python'),)#0
#t[0]='ddd'###TypeError: 'tuple' object does not support item assignment
print(t)
print('6***************************')
